{
    "mobileBottomRow": 5,
    "widgetName": "Text9",
    "displayName": "Text",
    "iconSVG": "/static/media/icon.a47d6d5dbbb718c4dc4b2eb4f218c1b7.svg",
    "searchTags": [
        "typography",
        "paragraph",
        "label"
    ],
    "topRow": 4,
    "bottomRow": 92,
    "type": "TEXT_WIDGET",
    "hideCard": false,
    "mobileRightColumn": 41,
    "animateLoading": true,
    "overflow": "NONE",
    "fontFamily": "{{appsmith.theme.fontFamily.appFont}}",
    "dynamicTriggerPathList": [],
    "leftColumn": 1,
    "dynamicBindingPathList": [
        {"key": "truncateButtonColor"},
        {"key": "fontFamily"},
        {"key": "borderRadius"}
    ],
    "shouldTruncate": false,
    "truncateButtonColor": "{{appsmith.theme.colors.primaryColor}}",
    "text": "<a href=\"https://fas.st/t/idH9ZSyP\" target=\"_blank\">n8n  is a source-available low-code workflow automation tool<\/a>. This Appsmith project extends n8n dashboard and provides a more structured overview of the workflows, their basic characteristics, and past executions. On top of that, it allows generating draft workflow documentation in just a single mouse click.\n\n<b><i>Note:<\/i><\/b> The dashboard contains referral links to the n8n website. Consider keeping and using these links — it helps the development of this free tool. Your support is greatly appreciated! 😊\n<h3>How to Use this Dashboard<\/h3><ul><li>Upon first load, a modal window will appear requesting dashboard configurations.<\/li><li>Enter the <a href=\"https://fas.st/t/JK9aQVQ8\" target=\"_blank\">n8n API key<\/a> and your n8n instance URL, then press <em>Confirm<\/em> to start loading the data.<\/li><li>Press <em>Reset<\/em> top menu item to clear the configuration data.<\/li><\/ul><h3>Dashboard Overview<\/h3>The top middle section contains three buttons that allow for the selection of all workflows, only active workflows, or only those with recent execution history.\n\nThe main table provides a general overview of the workflows. Click on the URL icon to navigate directly to the individual workflow on your n8n instance.<h3>📋 Overview Pane<\/h3>The default view is the Overview pane. When you click on a workflow with an execution history, a chart displaying the duration of each recent workflow execution will appear beneath the main table. Successful and failed executions are color-coded according to your app theme. Click on an individual bar to access the workflow history screen in your n8n instance<h3>✒️ Docs Pane<\/h3>Click on the Docs Pane to access the workflow documentation features. This pane includes the following elements beneath the main table:\n\n<ul><li>A rich text editor for workflow documentation;<\/li><li>A panel displaying workflow metrics;<\/li><li>Two buttons that leverage GPT-4 to assist in writing workflow documentation;<\/li><li>A download button for saving your documentation.<\/li><\/ul>\nSelect a workflow to view its metrics. Click on the Node Type to open a new window with node information on the n8n website.\n\nOnce a workflow is selected, clicking the <em>Brief<\/em> or <em>Detailed<\/em> description button will generate a draft of documentation within the rich text editor. You may edit this draft before downloading. Ensure that you have made at least one edit to enable the download of a valid HTML document.<h3>⚙️🛠️📈 About the Author 🚀🤖🦾<\/h3>For expert consultation and to boost the productivity of your business, reach out to <a href=\"https://www.linkedin.com/in/parsadanyan/\" target=\"_blank\">Eduard<\/a>.<\/p>",
    "key": "j6pgpm8vro",
    "isDeprecated": false,
    "rightColumn": 63,
    "textAlign": "LEFT",
    "dynamicHeight": "AUTO_HEIGHT",
    "widgetId": "i3y2croixu",
    "minWidth": 450,
    "isVisible": true,
    "fontStyle": "",
    "textColor": "#231F20",
    "version": 1,
    "parentId": "t4v1ww8pot",
    "tags": [
        "Suggested",
        "Content"
    ],
    "renderMode": "CANVAS",
    "isLoading": false,
    "mobileTopRow": 1,
    "responsiveBehavior": "fill",
    "originalTopRow": 4,
    "borderRadius": "{{appsmith.theme.borderRadius.appBorderRadius}}",
    "mobileLeftColumn": 1,
    "maxDynamicHeight": 9000,
    "originalBottomRow": 92,
    "fontSize": "1rem",
    "minDynamicHeight": 4
}